app/views/employees/_form.html.erb

SELECT `customers`.* FROM `customers`
---
          <= f.label :customer_id %>
          <= select("employee", "customer_id", Customer.all.collect {|p| [ p.name, p.id ] }, {include_blank: 'None'}) %>