app/views/employees/index.html.erb

          <tbody>
            <% @customer.employees.each do |employee| %>
---
SELECT `employees`.* FROM `employees` INNER JOIN `contacts` ON `contacts`.`employee_id` = `employees`.`id`