app/views/employees/show.html.erb

				          <tbody>
				            <% @employee.devices.each do |device| %>
---
SELECT `devices`.* FROM `devices` WHERE `devices`.`employee_id` = 2

				          <tbody>
				            <% @employee.attendances.each do |attendance| %>
---
SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`employee_id` = 1 ORDER BY marked_at desc