app/views/devices/index.html.erb

          <tbody>
            <% @employee.devices.each do |device| %>
---
SELECT `devices`.* FROM `devices` WHERE `devices`.`employee_id` = 2