app/views/summary_attendances/_form.html.erb

                <%= f.label :employee_id %>
            <%= f.collection_select :employee_id, Employee.all, :id, :run, prompt: true, :class => 'form-control'  %>
---
SELECT `employees`.* FROM `employees`

                <%= f.label :branch_office_id %>
            <%= f.collection_select :branch_office_id, BranchOffice.all, :id, :name, prompt: true, :class => 'form-control'  %>
---
SELECT `branch_offices`.* FROM `branch_offices`