app/views/branch_offices/_form.html.erb

                <= f.label :customer_id %>
            <= f.collection_select :customer_id, Customer.all, :id, :name, prompt: true, :class => 'form-control'  %>
---
SELECT `customers`.* FROM `customers`