app/views/branch_offices/index.html.erb

          <tbody>
            <% @customer.branch_offices.each do |branch_office| %>
---
SELECT `branch_offices`.* FROM `branch_offices` WHERE `branch_offices`.`customer_id` = 1