app/controllers/attendances_controller.rb

  def index
    @attendances = Attendance.all
    @employee = Employee.find(params[:employee_id])
---
SELECT `attendances`.* FROM `attendances`
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 ORDER BY `employees`.`id` ASC LIMIT 1

  def show
    @employee = Employee.find(params[:employee_id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 ORDER BY `employees`.`id` ASC LIMIT 1

  def new
    @attendance = Attendance.new
    @employee = Employee.find(params[:employee_id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1

  def edit
    @employee = Employee.find(params[:employee_id])
    @attendance = @employee.attendances.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 4 LIMIT 1
SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`employee_id` = 4 AND `attendances`.`id` = 8 LIMIT 1

  def create
    @employee = Employee.find(params[:employee_id])
    @attendance = @employee.attendances.new(attendance_params)

    if @attendance.save
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
INSERT INTO `attendances` (`created_at`, `employee_id`, `event`, `latitude`, `longitude`, `marked_at`, `updated_at`) VALUES ('2014-12-08 08:14:12', 1, 'Ingreso', '-33.430009', '-70.625485', '2014-12-02 08:13:00', '2014-12-08 08:14:12')

  def destroy
    @employee = Employee.find(params[:employee_id])
    @attendance = @employee.attendances.find(params[:id])

    @attendance.destroy
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 3 LIMIT 1
SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`employee_id` = 3 AND `attendances`.`id` = 6 LIMIT 1
DELETE FROM `attendances` WHERE `attendances`.`id` = 6

    def set_attendance
      @attendance = Attendance.find(params[:id])
---
SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`id` = 1 LIMIT 1