app/controllers/branch_offices_controller.rb

  def index
    @branch_offices = BranchOffice.all
---
SELECT `branch_offices`.* FROM `branch_offices`

  def create
    @branch_office = @customer.branch_offices.new(branch_office_params)

    if @branch_office.save
---
INSERT INTO `branch_offices` (`address`, `country`, `created_at`, `customer_id`, `name`, `region`, `updated_at`) VALUES ('Rafael Cañas #114 Oficina 1A. Metro Salvador Providencia', 'Chile', '2014-12-05 00:33:26', 1, 'Casa central', 'Metropolitana', '2014-12-05 00:33:26')

    def set_branch_office
      @branch_office = BranchOffice.find(params[:id])
---
SELECT `branch_offices`.* FROM `branch_offices` WHERE `branch_offices`.`id` = 1 LIMIT 1