app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts`
---
  def index
    @contacts = Contact.all

INSERT INTO `contacts` (`birthdate`, `created_at`, `email`, `lastnames`, `names`, `run`, `updated_at`) VALUES ('2009-08-29', '2014-12-02 17:37:51', 'mlandaetasanchez@gmail.com', 'Landaeta Sánchez', 'Mosheh-efra Osvaldo', '1-9', '2014-12-02 17:37:51')
---
  def create
    @contact = Contact.new(contact_params)

    if @contact.save

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
---
    def set_contact
      @contact = Contact.find(params[:id])