app/controllers/customers_controller.rb

SELECT `customers`.* FROM `customers`
---
  def index
    @customers = Customer.all

INSERT INTO `customers` (`clientType`, `created_at`, `email`, `name`, `rut`, `status`, `updated_at`) VALUES ('SpA', '2014-12-01 15:55:00', 'hola@requies.cl', 'Requies', '173098413', 1, '2014-12-01 15:55:00')
---
  def create
    @customer = Customer.new(customer_params)

    if @customer.save

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 ORDER BY `customers`.`id` ASC LIMIT 1
---
    def set_customer
      @customer = Customer.find(params[:id])