app/controllers/devices_controller.rb

  def index
    @employee = Employee.find(params[:employee_id])
    @devices = Device.all
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 2 ORDER BY `employees`.`id` ASC LIMIT 1
SELECT `devices`.* FROM `devices`

  def show
    @employee = Employee.find(params[:employee_id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 2 ORDER BY `employees`.`id` ASC LIMIT 1

  def new
    @employee = Employee.find(params[:employee_id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 2 LIMIT 1

  def create
    @employee = Employee.find(params[:employee_id])
    @device = @employee.devices.new(device_params)

    if @device.save
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 2 LIMIT 1
INSERT INTO `devices` (`created_at`, `employee_id`, `esn`, `imei`, `meid`, `updated_at`, `wlanMacAddress`) VALUES ('2014-12-05 02:01:03', 2, '121212121221', '1111 111111 11', '111111 11111 111', '2014-12-05 02:01:03', '12:32:23:23')

    def set_device
      @device = Device.find(params[:id])
---
SELECT `devices`.* FROM `devices` WHERE `devices`.`id` = 1 LIMIT 1