app/controllers/employees_controller.rb

INSERT INTO `employees` (`addres`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `birthdate`, `contract_type`, `created_at`, `customer_id`, `email`, `lastnames`, `names`, `run`, `updated_at`, `weekly_hours`, `worker_id`) VALUES ('Embajador Quintana 4368', 'image/jpeg', 'yo.jpg', 6932, '2014-12-04 23:07:44', '2009-12-04', 'Diurno', '2014-12-04 23:07:45', 1, 'mlandaetasanchez@gmail.com', 'Landaeta Sanchez', 'Mosheh-efra Osvaldo', '1-9', '2014-12-04 23:07:45', 45, '1')
---
  def create
    @employee = @customer.employees.new(employee_params)

    if @employee.save

SELECT `employees`.* FROM `employees` WHERE `employees`.`customer_id` = 1 AND `employees`.`id` = 4 LIMIT 1
DELETE FROM `employees` WHERE `employees`.`id` = 1
---
  def destroy
    @employee = @customer.employees.find(params[:id])
    @employee.destroy

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 2 ORDER BY `employees`.`id` ASC LIMIT 1
---
    def set_employee
      @employee = Employee.find(params[:id])