app/controllers/home_controller.rb

  def set_user
  	if user_signed_in?
	  	@user = current_user
	  	@customer = Customer.where(:id => @user.customer_id).first
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` IS NULL ORDER BY `customers`.`id` ASC LIMIT 1