app/controllers/summary_attendances_controller.rb

SELECT `employees`.* FROM `employees` WHERE `employees`.`customer_id` = 1
SELECT `summary_attendances`.* FROM `summary_attendances` WHERE `summary_attendances`.`employee_id` = 1
SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`employee_id` = 1 ORDER BY `attendances`.`marked_at` ASC
---
  def generate_summaries
    # Borrando summary_attendances anteriores.
    @customer.employees.each do |employee|
      employee.summary_attendances.each do |sa|
        sa.destroy
      end
    end

    ## Teniendo en cuenta que en la logica de la aplicación móvil, se marcan eventos alternanados;
    # Es decir, primero un ingreso y luego un egreso, se procede a generar los resumenes para cada jornada de trabajo.
    @customer.employees.each do |employee|
      employee.attendances.order(marked_at: :asc).each do |att|

INSERT INTO `summary_attendances` (`attendace_date`, `check_in_at`, `check_out_at`, `contracted_hours`, `created_at`, `customer_id`, `employee_id`, `updated_at`, `worked_hours`) VALUES ('2014-12-02', '2014-12-02 08:13:00', '2014-12-03 13:22:00', 40, '2014-12-09 05:11:54', 1, 1, '2014-12-09 05:11:54', '1 - 5:9:0')
---
          summary_attendance.contracted_hours = employee.weekly_hours
          summary_attendance.worked_hours = worked_hours[:day].to_s + ' - ' + worked_hours[:hour].to_s + ':' + worked_hours[:minute].to_s + ':' + worked_hours[:second].to_s
          summary_attendance.employee = employee
          # Se persiste el resumen asistencial.
          summary_attendance.save

SELECT COUNT(*) FROM `employees` WHERE `employees`.`customer_id` = 1
SELECT `employees`.* FROM `employees` WHERE `employees`.`customer_id` = 1
SELECT `summary_attendances`.* FROM `summary_attendances` WHERE `summary_attendances`.`employee_id` = 1
---
  def export_summaries

    Spreadsheet.client_encoding = 'UTF-8'

    @book = Spreadsheet::Workbook.new

    @num = @customer.employees.size
    @count = 0
    @sheets = Array.new(@num)
    @customer.employees.each do |employee|

      @sheets[@count] = @book.create_worksheet

      @sheets[@count].name = employee.run.to_s
      puts @sheets[@count].name

      @sheets[@count].row(0).concat ["HOJA DE ASISTENCIA"]
      @sheets[@count].row(2).concat ["DATOS EMPLEADO"]
      @sheets[@count].row(3).concat ["Nombres:", employee.names]
      @sheets[@count].row(4).concat ["Apellidos:", employee.lastnames]
      @sheets[@count].row(5).concat ["RUN:", employee.run]
      @sheets[@count].row(6).concat ["Email:", employee.email]
      @sheets[@count].row(7).concat ["Dirección:", employee.addres]

      @sheets[@count].row(9).concat ["RESUMEN DE ASISTENCIA"]
      @sheets[@count].row(10).concat %w{Fecha Hora_ingreso Hora_egreso Horas_trabajadas Horas_contratadas Diferencia Retraso Permiso}

      @cantAtt = 11
      employee.summary_attendances.each do |sa|

SELECT `summary_attendances`.* FROM `summary_attendances`
---
  def index
    @summary_attendances = SummaryAttendance.all

DELETE FROM `summary_attendances` WHERE `summary_attendances`.`id` = 1
---
  def destroy
    @summary_attendance.destroy

SELECT `summary_attendances`.* FROM `summary_attendances` WHERE `summary_attendances`.`id` = 34 LIMIT 1
---
    def set_summary_attendance
      @summary_attendance = SummaryAttendance.find(params[:id])