app/controllers/summary_attendances_controller.rb

SELECT `employees`.* FROM `employees` WHERE `employees`.`customer_id` = 1
SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`employee_id` = 1
SELECT `summary_attendances`.* FROM `summary_attendances` WHERE `summary_attendances`.`employee_id` = 1
SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`employee_id` = 1 ORDER BY `attendances`.`marked_at` ASC
---
  def generating_summaries
    # Borrando summary_attendances anteriores.
    @customer.employees.each do |employee|
      employee.summary_attendances.each do |sa|
        sa.destroy
      end
    end

    ## Teniendo en cuenta que en la logica de la aplicación móvil, se marcan eventos alternanados;
    # Es decir, primero un ingreso y luego un egreso, se procede a generar los resumenes para cada jornada de trabajo.
    @customer.employees.each do |employee|
      employee.attendances.order(marked_at: :asc).each do |att|

INSERT INTO `summary_attendances` (`check_in_at`, `check_out_at`, `created_at`, `employee_id`, `updated_at`, `worked_hours`) VALUES ('2014-12-02 08:13:00', '2014-12-03 13:22:00', '2014-12-09 02:08:35', 1, '2014-12-09 02:08:35', '---\n:year: 0\n:month: 0\n:week: 0\n:day: 1\n:hour: 5\n:minute: 9\n:second: 0\n:diff: 1 day and 05:09:00\n')
---
          summary_attendance.contracted_hours = employee.weekly_hours
          summary_attendance.worked_hours = worked_hours[:day].to_s + ' - ' + worked_hours[:hour].to_s + ':' + worked_hours[:minute].to_s + ':' + worked_hours[:second].to_s
          summary_attendance.employee = employee
          # Se persiste el resumen asistencial.
          summary_attendance.save