app/views/attendances/_form.html.erb

                <= f.label :employee_id %>
            <= f.collection_select :employee_id, Employee.all, :id, :run, prompt: true, :class => 'form-control'  %>
---
SELECT `employees`.* FROM `employees`