app/views/attendances/index.html.erb

SELECT `attendances`.* FROM `attendances` WHERE `attendances`.`employee_id` = 1 ORDER BY marked_at desc
---
          <tbody>
            <% @employee.attendances.order("marked_at desc").each do |attendance| %>